# from zhipuai import ZhipuAI


# api_key = "7f11a0c1734468449b5cb6dd8347e0c9.UVq18ZKMc99qDvPp"
# video_desc = "孙燕姿的歌曲我也很想他。"
# sub_text = """0.00	3.00	这首歌 我也很想它
# 24.00	28.00	那时我们总有好不错
# 28.00	31.00	什么事都可以讲
# 31.00	35.00	我的爱情比你早
# 35.00	39.00	却一直放在心上
# 39.00	43.00	后来你们之间的变化
# 43.00	46.00	我不想再多说话
# 46.00	49.00	经过的相遇和挣扎
# 49.00	56.00	我还是无法将它放下
# 57.00	61.00	是多久后的时辈
# 61.00	65.00	有一天你突然摸摸
# 65.00	67.00	在那个时候
# 67.00	71.00	想否也爱着它
# 71.00	72.00	我眼前看
# 72.00	74.00	我冷到遗憾
# 74.00	76.00	在它的身上
# 76.00	78.00	从早的翅膀
# 78.00	82.00	只是那时的它
# 82.00	84.00	是因为你
# 84.00	87.00	还开始飞向我眼前看
# 87.00	89.00	在某个地方
# 89.00	91.00	我少了点感
# 91.00	93.00	你差了点吧
# 93.00	98.00	回家天还是那么短
# 98.00	104.00	两样尘域长
# 107.00	111.00	那时我们总有好多话
# 111.00	114.00	什么事都可以讲
# 114.00	118.00	我的爱情比你早
# 118.00	122.00	却一直放在心上
# 122.00	126.00	后来你们之间的变化
# 126.00	129.00	我不想再多说话
# 129.00	133.00	经过的相遇和挣扎
# 133.00	138.00	我还是无法将它放下
# 138.00	142.00	是多久后的时辈
# 142.00	146.00	有一天你突然摸摸
# 146.00	148.00	在那个时候
# 148.00	151.00	想否也爱着它
# 151.00	153.00	我也很想看
# 153.00	155.00	我冷到遗憾
# 155.00	157.00	在它的身上
# 157.00	159.00	从早的翅膀
# 159.00	163.00	只是那时的它
# 163.00	165.00	是因为你
# 165.00	167.00	还开始飞向我眼前看
# 167.00	169.00	我也很想看
# 169.00	171.00	在某个地方
# 171.00	173.00	我少了点感
# 173.00	175.00	你差了点吧
# 175.00	180.00	回家天还是那么短
# 180.00	185.00	四年却很长
# 185.00	187.00	还记得
# 187.00	189.00	当年我们曾
# 189.00	193.00	许下的愿望
# 193.00	195.00	谢谢变了
# 195.00	200.00	我们决定自上了一刻
# 200.00	207.00	真正地休的学分
# 207.00	209.00	我也很想看
# 209.00	211.00	我们都一样
# 211.00	213.00	在它的身上
# 213.00	215.00	从早的翅膀
# 215.00	219.00	只是那时的它
# 219.00	221.00	是因为你
# 221.00	224.00	还开始飞向我眼前看
# 224.00	226.00	在某个地方
# 226.00	228.00	我少了点感
# 228.00	230.00	你差了点吧
# 230.00	235.00	回家天还是那么短
# 235.00	242.00	四年却很长
# 242.00	248.00	我们都一样
# 255.00	256.00	继续
# 256.00	257.00	继续
# """


# client = ZhipuAI(api_key=api_key)  # 请填写您自己的APIKey
# response = client.chat.completions.create(
#     model="glm-4-flash",  # 请填写您要调用的模型名称 flash--免费
#     messages=[
#         {"role": "user", "content": "作为一位智能助手，请为我的视频的语音识别生成的字幕文本根据进行优化。要求根据语义修改一些识别错误的文本。不要改变原来的文本格式。"},
#         {"role": "assistant", "content": "当然，请告诉我一些关于您视频的信息"},
#         {"role": "user", "content": video_desc},
#         {"role": "assistant", "content": "请告诉我字幕文本每一行的格式"},
#         {"role": "user", "content": "'start':float\t'end':float\t'text':string"},
#         {"role": "assistant", "content": "请告诉我你已经生成的字幕文本。"},
#         {"role": "user", "content": sub_text},
#     ],
#     response_format={ "type": "json_object" },
#     request_id="123456"
# )
# print(dict(response.choices[0].message))
# # response = client.chat.completions.create(
# #     model="glm-4-flash",  # 请填写您要调用的模型名称 flash--免费
# #     messages=[
# #         {"role": "user", "content": "请从百度搜索这首歌的歌词，然后严格按照搜索结果再次修改刚才生成的字幕"},
# #     ],
# #     response_format={ "type": "json_object" },
# #     request_id="123456"
# # )
# # print(dict(response.choices[0].message))